W7D1/ninetyninecatsAUTH/app/models/user.rb

  def self.find_by_credentials(username,password)
    user = User.find_by(user_name: username)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "anne"], ["LIMIT", 1]]