nintyninecats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Very mean cat!\r\n    "], ["updated_at", "2019-11-22 23:20:23.402249"], ["id", 1]]