W7D1/ninetyninecatsAUTH/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "wjtK7dItbW4pr2T5_E2Ykw"], ["LIMIT", 1]]
---
  def current_user
    return nil if session[:session_token].nil?

    @user ||= User.find_by(session_token: session[:session_token])