W7D1/ninetyninecatsAUTH/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save!